XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_dma.c
    return bitstatus;
}

/*********************************************************************
 * @fn      DMA_ClearITPendingBit
 *
 * @brief   Clears the DMAy Channelx's interrupt pending bits.
 *
 * @param   DMAy_IT - specifies the DMAy interrupt source to check.
 *            DMA1_IT_GL1 - DMA1 Channel1 global flag.
 *            DMA1_IT_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_IT_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_IT_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_IT_GL2 - DMA1 Channel2 global flag.
 *            DMA1_IT_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_IT_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_IT_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_IT_GL3 - DMA1 Channel3 global flag.
 *            DMA1_IT_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_IT_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_IT_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_IT_GL4 - DMA1 Channel4 global flag.
 *            DMA1_IT_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_IT_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_IT_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_IT_GL5 - DMA1 Channel5 global flag.
 *            DMA1_IT_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_IT_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_IT_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_IT_GL6 - DMA1 Channel6 global flag.
 *            DMA1_IT_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_IT_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_IT_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_IT_GL7 - DMA1 Channel7 global flag.
 *            DMA1_IT_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_IT_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_IT_TE7 - DMA1 Channel7 transfer error flag. 
 *            DMA1_IT_GL8 - DMA1 Channel8 global flag.
 *            DMA1_IT_TC8 - DMA1 Channel8 transfer complete flag.
 *            DMA1_IT_HT8 - DMA1 Channel8 half transfer flag.
 *            DMA1_IT_TE8 - DMA1 Channel8 transfer error flag.
 *            DMA1_IT_GL9 - DMA1 Channel9 global flag.
 *            DMA1_IT_TC9 - DMA1 Channel9 transfer complete flag.
 *            DMA1_IT_HT9 - DMA1 Channel9 half transfer flag.
 *            DMA1_IT_TE9 - DMA1 Channel9 transfer error flag.
 *            DMA1_IT_GL10 - DMA1 Channel10 global flag.
 *            DMA1_IT_TC10 - DMA1 Channel10 transfer complete flag.
 *            DMA1_IT_HT10 - DMA1 Channel10 half transfer flag.
 *            DMA1_IT_TE10 - DMA1 Channel10 transfer error flag.
 *            DMA1_IT_GL11 - DMA1 Channel11 global flag.
 *            DMA1_IT_TC11 - DMA1 Channel11 transfer complete flag.
 *            DMA1_IT_HT11 - DMA1 Channel11 half transfer flag.
 *            DMA1_IT_TE11 - DMA1 Channel11 transfer error flag.
 *            DMA1_IT_GL12 - DMA1 Channel12 global flag.
 *            DMA1_IT_TC12 - DMA1 Channel12 transfer complete flag.
 *            DMA1_IT_HT12 - DMA1 Channel12 half transfer flag.
 *            DMA1_IT_TE12 - DMA1 Channel12 transfer error flag.
 *            DMA1_IT_GL13 - DMA1 Channel13 global flag.
 *            DMA1_IT_TC13 - DMA1 Channel13 transfer complete flag.
 *            DMA1_IT_HT13 - DMA1 Channel13 half transfer flag.
 *            DMA1_IT_TE13 - DMA1 Channel13 transfer error flag. 
 *            DMA2_IT_GL1 - DMA2 Channel1 global flag.
 *            DMA2_IT_TC1 - DMA2 Channel1 transfer complete flag.
 *            DMA2_IT_HT1 - DMA2 Channel1 half transfer flag.
 *            DMA2_IT_TE1 - DMA2 Channel1 transfer error flag.
 *            DMA2_IT_GL2 - DMA2 Channel2 global flag.
 *            DMA2_IT_TC2 - DMA2 Channel2 transfer complete flag.
 *            DMA2_IT_HT2 - DMA2 Channel2 half transfer flag.
 *            DMA2_IT_TE2 - DMA2 Channel2 transfer error flag.
 *            DMA2_IT_GL3 - DMA2 Channel3 global flag.
 *            DMA2_IT_TC3 - DMA2 Channel3 transfer complete flag.
 *            DMA2_IT_HT3 - DMA2 Channel3 half transfer flag.
 *            DMA2_IT_TE3 - DMA2 Channel3 transfer error flag.
 *            DMA2_IT_GL4 - DMA2 Channel4 global flag.
 *            DMA2_IT_TC4 - DMA2 Channel4 transfer complete flag.
 *            DMA2_IT_HT4 - DMA2 Channel4 half transfer flag.
 *            DMA2_IT_TE4 - DMA2 Channel4 transfer error flag.
 *            DMA2_IT_GL5 - DMA2 Channel5 global flag.
 *            DMA2_IT_TC5 - DMA2 Channel5 transfer complete flag.
 *            DMA2_IT_HT5 - DMA2 Channel5 half transfer flag.
 *            DMA2_IT_TE5 - DMA2 Channel5 transfer error flag.
 *            DMA2_IT_GL6 - DMA2 Channel6 global flag.
 *            DMA2_IT_TC6 - DMA2 Channel6 transfer complete flag.
 *            DMA2_IT_HT6 - DMA2 Channel6 half transfer flag.
 *            DMA2_IT_TE6 - DMA2 Channel6 transfer error flag.
 *            DMA2_IT_GL7 - DMA2 Channel7 global flag.
 *            DMA2_IT_TC7 - DMA2 Channel7 transfer complete flag.
 *            DMA2_IT_HT7 - DMA2 Channel7 half transfer flag.
 *            DMA2_IT_TE7 - DMA2 Channel7 transfer error flag.
 *            DMA2_IT_GL8 - DMA2 Channel8 global flag.
 *            DMA2_IT_TC8 - DMA2 Channel8 transfer complete flag.
 *            DMA2_IT_HT8 - DMA2 Channel8 half transfer flag.
 *            DMA2_IT_TE8 - DMA2 Channel8 transfer error flag.
 *            DMA2_IT_GL9 - DMA2 Channel9 global flag.
 *            DMA2_IT_TC9 - DMA2 Channel9 transfer complete flag.
 *            DMA2_IT_HT9 - DMA2 Channel9 half transfer flag.
 *            DMA2_IT_TE9 - DMA2 Channel9 transfer error flag.
 *            DMA2_IT_GL10 - DMA2 Channel10 global flag.
 *            DMA2_IT_TC10 - DMA2 Channel10 transfer complete flag.
 *            DMA2_IT_HT10 - DMA2 Channel10 half transfer flag.
 *            DMA2_IT_TE10 - DMA2 Channel10 transfer error flag.
 *            DMA2_IT_GL11 - DMA2 Channel11 global flag.
 *            DMA2_IT_TC11 - DMA2 Channel11 transfer complete flag.
 *            DMA2_IT_HT11 - DMA2 Channel11 half transfer flag.
 *            DMA2_IT_TE11 - DMA2 Channel11 transfer error flag.
 *
 * @return  none
 */
void DMA_ClearITPendingBit(uint32_t DMAy_IT)
{
    if((DMAy_IT & FLAG_Mask) == FLAG_Mask)
    {
        DMA2->INTFCR = DMAy_IT;
    }
    else if((DMAy_IT & DMA2_EXTEN_FLAG_Mask) == DMA2_EXTEN_FLAG_Mask)
    {
        DMA2_EXTEN->INTFCR = DMAy_IT;
    }
    else if((DMAy_IT & DMA1_EXTEN_FLAG_Mask) == DMA1_EXTEN_FLAG_Mask)
    {
        DMA1_EXTEN->INTFCR = DMAy_IT;
    }
    else
    {
        DMA1->INTFCR = DMAy_IT;
    }
}
